### 결측치 처리

In [1]:
import pandas as pd
data = pd.read_csv('./../../data/bigboongi/Ex_Missing.csv', encoding='utf-8')
data

   salary         sales        roe  industry
0  1095.0  27595.000000  14.100000         1
1     NaN   9958.000000  10.900000         1
2     NaN   6125.899902  23.500000         1
3   578.0  16246.000000   5.900000         1
4  1368.0           NaN  13.800000         1
5  1145.0           NaN  20.000000         2
6  1078.0   2266.699951  16.400000         2
7  1094.0   2966.800049  16.299999         2
8  1237.0   4570.200195  10.500000         2
9   833.0   2830.000000        NaN         2

* isnull() - 결측이면 True, 결측이 아니면 False

In [2]:
pd.isnull(data)
data.isnull()

   salary  sales    roe  industry
0   False  False  False     False
1    True  False  False     False
2    True  False  False     False
3   False  False  False     False
4   False   True  False     False
5   False   True  False     False
6   False  False  False     False
7   False  False  False     False
8   False  False  False     False
9   False  False   True     False

* notnull() - 결측이면 False, 결측이 아니면 True

In [3]:
pd.notnull(data)
data.notnull()

   salary  sales    roe  industry
0    True   True   True      True
1   False   True   True      True
2   False   True   True      True
3    True   True   True      True
4    True  False   True      True
5    True  False   True      True
6    True   True   True      True
7    True   True   True      True
8    True   True   True      True
9    True   True  False      True

* 변수(컬럼)별로 결측값 개수 확인하기 위해서는 df.isnull().sum() 함수 이용

In [4]:
data.isnull().sum()

salary      2
sales       2
roe         1
industry    0
dtype: int64

* 특정 변수(컬럼)의 결측값 개수 확인 - df.isnull().sum()

In [6]:
data['salary'].isnull().sum()

2

* 변수(컬럼)별로 결측이 아닌 값의 개수 확인 - df.notnull().sum()

In [7]:
data.notnull().sum()

salary       8
sales        8
roe          9
industry    10
dtype: int64

* 특정 변수(컬럼)이 아닌 값의 개수 확인 - df.notnull().sum()

In [9]:
data['salary'].notnull().sum()

8

* 행별 결측 확인 및 저장 - df.isnull().sum(1)

In [10]:
data.isnull().sum(1)

0    0
1    1
2    1
3    0
4    1
5    1
6    0
7    0
8    0
9    1
dtype: int64

In [11]:
data['missing'] = data.isnull().sum(1)
data

   salary         sales        roe  industry  missing
0  1095.0  27595.000000  14.100000         1        0
1     NaN   9958.000000  10.900000         1        1
2     NaN   6125.899902  23.500000         1        1
3   578.0  16246.000000   5.900000         1        0
4  1368.0           NaN  13.800000         1        1
5  1145.0           NaN  20.000000         2        1
6  1078.0   2266.699951  16.400000         2        0
7  1094.0   2966.800049  16.299999         2        0
8  1237.0   4570.200195  10.500000         2        0
9   833.0   2830.000000        NaN         2        1

* 행(row) 단위로 실측값 개수 구하기 - df.notnull().sum(1)

In [12]:
del data['missing']
data['valid'] = data.notnull().sum(1)

In [13]:
data

   salary         sales        roe  industry  valid
0  1095.0  27595.000000  14.100000         1      4
1     NaN   9958.000000  10.900000         1      3
2     NaN   6125.899902  23.500000         1      3
3   578.0  16246.000000   5.900000         1      4
4  1368.0           NaN  13.800000         1      3
5  1145.0           NaN  20.000000         2      3
6  1078.0   2266.699951  16.400000         2      4
7  1094.0   2966.800049  16.299999         2      4
8  1237.0   4570.200195  10.500000         2      4
9   833.0   2830.000000        NaN         2      3

### 결측값 제거 : dropna()

* 결측값이 있는 행(row/case) 제거 - 행은 축이 0
* dropna(axis=0)
* 결측이 있는 행(가로)가 제거

In [14]:
data_del_row = data.dropna(axis=0)
data_del_row

   salary         sales        roe  industry  valid
0  1095.0  27595.000000  14.100000         1      4
3   578.0  16246.000000   5.900000         1      4
6  1078.0   2266.699951  16.400000         2      4
7  1094.0   2966.800049  16.299999         2      4
8  1237.0   4570.200195  10.500000         2      4

* 결측값이 있는 열(column/variable) 제거 - 열은 축이 1
* 결측치가 하나라도 있는 변수는 제거됨

In [15]:
data_del_col = data.dropna(axis=1)
data_del_col

   industry  valid
0         1      4
1         1      3
2         1      3
3         1      4
4         1      3
5         2      3
6         2      4
7         2      4
8         2      4
9         2      3

* 결측값 있는 특정 행/열 제거 - 데이터[['변수명']].dropna()

In [16]:
data[['salary']].dropna()

   salary
0  1095.0
3   578.0
4  1368.0
5  1145.0
6  1078.0
7  1094.0
8  1237.0
9   833.0

* dropna()의 기본은 dropna(axis=0)

In [17]:
data[['salary', 'sales', 'roe', 'industry']].dropna()

   salary         sales        roe  industry
0  1095.0  27595.000000  14.100000         1
3   578.0  16246.000000   5.900000         1
6  1078.0   2266.699951  16.400000         2
7  1094.0   2966.800049  16.299999         2
8  1237.0   4570.200195  10.500000         2

In [18]:
data[['salary', 'sales', 'roe', 'industry']].dropna(axis=0)

   salary         sales        roe  industry
0  1095.0  27595.000000  14.100000         1
3   578.0  16246.000000   5.900000         1
6  1078.0   2266.699951  16.400000         2
7  1094.0   2966.800049  16.299999         2
8  1237.0   4570.200195  10.500000         2

In [19]:
data[['salary', 'sales', 'roe', 'industry']].dropna(axis=1)

   industry
0         1
1         1
2         1
3         1
4         1
5         2
6         2
7         2
8         2
9         2

### 결측값 대체 - fillna()

In [20]:
data = pd.read_csv('./../../data/bigboongi/Ex_Missing.csv', encoding='utf-8')
data

   salary         sales        roe  industry
0  1095.0  27595.000000  14.100000         1
1     NaN   9958.000000  10.900000         1
2     NaN   6125.899902  23.500000         1
3   578.0  16246.000000   5.900000         1
4  1368.0           NaN  13.800000         1
5  1145.0           NaN  20.000000         2
6  1078.0   2266.699951  16.400000         2
7  1094.0   2966.800049  16.299999         2
8  1237.0   4570.200195  10.500000         2
9   833.0   2830.000000        NaN         2

* 특정값으로 대체 - df.fillna(value/string)

In [21]:
data_0 = data.fillna(0)
data_0

   salary         sales        roe  industry
0  1095.0  27595.000000  14.100000         1
1     0.0   9958.000000  10.900000         1
2     0.0   6125.899902  23.500000         1
3   578.0  16246.000000   5.900000         1
4  1368.0      0.000000  13.800000         1
5  1145.0      0.000000  20.000000         2
6  1078.0   2266.699951  16.400000         2
7  1094.0   2966.800049  16.299999         2
8  1237.0   4570.200195  10.500000         2
9   833.0   2830.000000   0.000000         2

In [22]:
data_missing = data.fillna('missing')
data_missing

    salary        sales        roe  industry
0   1095.0      27595.0       14.1         1
1  missing       9958.0       10.9         1
2  missing  6125.899902       23.5         1
3    578.0      16246.0        5.9         1
4   1368.0      missing       13.8         1
5   1145.0      missing       20.0         2
6   1078.0  2266.699951       16.4         2
7   1094.0  2966.800049  16.299999         2
8   1237.0  4570.200195       10.5         2
9    833.0       2830.0    missing         2

* 해당 변수의 앞의 값으로 채우기 - df.fillna(method='ffill') or df.fillna(method='pad')

In [23]:
data_ffill = data.fillna(method='ffill')
data_ffill

   salary         sales        roe  industry
0  1095.0  27595.000000  14.100000         1
1  1095.0   9958.000000  10.900000         1
2  1095.0   6125.899902  23.500000         1
3   578.0  16246.000000   5.900000         1
4  1368.0  16246.000000  13.800000         1
5  1145.0  16246.000000  20.000000         2
6  1078.0   2266.699951  16.400000         2
7  1094.0   2966.800049  16.299999         2
8  1237.0   4570.200195  10.500000         2
9   833.0   2830.000000  10.500000         2

In [24]:
data_pad = data.fillna(method='pad')
data

   salary         sales        roe  industry
0  1095.0  27595.000000  14.100000         1
1     NaN   9958.000000  10.900000         1
2     NaN   6125.899902  23.500000         1
3   578.0  16246.000000   5.900000         1
4  1368.0           NaN  13.800000         1
5  1145.0           NaN  20.000000         2
6  1078.0   2266.699951  16.400000         2
7  1094.0   2966.800049  16.299999         2
8  1237.0   4570.200195  10.500000         2
9   833.0   2830.000000        NaN         2

* 결측값을 뒷방향으로 채우기 - df.fillna(method='bfill') or df.fillna(method='backfill')

In [25]:
data_bfill = data.fillna(method='bfill')
data_bfill

   salary         sales        roe  industry
0  1095.0  27595.000000  14.100000         1
1   578.0   9958.000000  10.900000         1
2   578.0   6125.899902  23.500000         1
3   578.0  16246.000000   5.900000         1
4  1368.0   2266.699951  13.800000         1
5  1145.0   2266.699951  20.000000         2
6  1078.0   2266.699951  16.400000         2
7  1094.0   2966.800049  16.299999         2
8  1237.0   4570.200195  10.500000         2
9   833.0   2830.000000        NaN         2

In [26]:
data_backfill = data.fillna(method='backfill')
data_backfill

   salary         sales        roe  industry
0  1095.0  27595.000000  14.100000         1
1   578.0   9958.000000  10.900000         1
2   578.0   6125.899902  23.500000         1
3   578.0  16246.000000   5.900000         1
4  1368.0   2266.699951  13.800000         1
5  1145.0   2266.699951  20.000000         2
6  1078.0   2266.699951  16.400000         2
7  1094.0   2966.800049  16.299999         2
8  1237.0   4570.200195  10.500000         2
9   833.0   2830.000000        NaN         2

* 결측값 평균 대체 - df.fillna(df.mean()), df.where(pd.notnull(df), df.mean(), axis='columns')

In [27]:
data_mean = data.fillna(data.mean())
data_mean

   salary         sales        roe  industry
0  1095.0  27595.000000  14.100000         1
1  1053.5   9958.000000  10.900000         1
2  1053.5   6125.899902  23.500000         1
3   578.0  16246.000000   5.900000         1
4  1368.0   9069.825012  13.800000         1
5  1145.0   9069.825012  20.000000         2
6  1078.0   2266.699951  16.400000         2
7  1094.0   2966.800049  16.299999         2
8  1237.0   4570.200195  10.500000         2
9   833.0   2830.000000  14.600000         2

In [28]:
data_median = data.fillna(data.median())
data_median

   salary         sales        roe  industry
0  1095.0  27595.000000  14.100000         1
1  1094.5   9958.000000  10.900000         1
2  1094.5   6125.899902  23.500000         1
3   578.0  16246.000000   5.900000         1
4  1368.0   5348.050049  13.800000         1
5  1145.0   5348.050049  20.000000         2
6  1078.0   2266.699951  16.400000         2
7  1094.0   2966.800049  16.299999         2
8  1237.0   4570.200195  10.500000         2
9   833.0   2830.000000  14.100000         2

In [29]:
data_max = data.fillna(data.max())
data_max

   salary         sales        roe  industry
0  1095.0  27595.000000  14.100000         1
1  1368.0   9958.000000  10.900000         1
2  1368.0   6125.899902  23.500000         1
3   578.0  16246.000000   5.900000         1
4  1368.0  27595.000000  13.800000         1
5  1145.0  27595.000000  20.000000         2
6  1078.0   2266.699951  16.400000         2
7  1094.0   2966.800049  16.299999         2
8  1237.0   4570.200195  10.500000         2
9   833.0   2830.000000  23.500000         2

In [30]:
data_other_mean = data.fillna(data.mean()['salary'])
data_other_mean

   salary         sales          roe  industry
0  1095.0  27595.000000    14.100000         1
1  1053.5   9958.000000    10.900000         1
2  1053.5   6125.899902    23.500000         1
3   578.0  16246.000000     5.900000         1
4  1368.0   1053.500000    13.800000         1
5  1145.0   1053.500000    20.000000         2
6  1078.0   2266.699951    16.400000         2
7  1094.0   2966.800049    16.299999         2
8  1237.0   4570.200195    10.500000         2
9   833.0   2830.000000  1053.500000         2

* 다른 변수 값으로 대체

In [ ]:
import numpy as np
data2 = data.copy()
data2['sales_new'] = np.where(pd.notnull(data2['sales']) == True, data2['sales'], data2['salary'])

* 집단 평균값으로 대체

In [31]:
data.groupby('industry').mean()

               salary         sales    roe
industry
1         1013.666667  14981.224976  13.64
2         1077.400000   3158.425049  15.80

* lambda 함수 -> 평균으로 대체하는 함수 생성

In [32]:
fill_mean_func = lambda g: g.fillna(g.mean())

In [33]:
data_group_mean = data.groupby('industry').apply(fill_mean_func)
data_group_mean

                 salary         sales        roe  industry
industry
1        0  1095.000000  27595.000000  14.100000         1
         1  1013.666667   9958.000000  10.900000         1
         2  1013.666667   6125.899902  23.500000         1
         3   578.000000  16246.000000   5.900000         1
         4  1368.000000  14981.224975  13.800000         1
2        5  1145.000000   3158.425049  20.000000         2
         6  1078.000000   2266.699951  16.400000         2
         7  1094.000000   2966.800049  16.299999         2
         8  1237.000000   4570.200195  10.500000         2
         9   833.000000   2830.000000  15.800000         2

In [34]:
fill_values = {1: 1000, 2:2000}

In [35]:
fill_func = lambda d: d.fillna(fill_values[d.name])

In [37]:
data_group_value = data.groupby('industry').apply(fill_func)
data_group_value

   salary         sales          roe  industry
0  1095.0  27595.000000    14.100000         1
1  1000.0   9958.000000    10.900000         1
2  1000.0   6125.899902    23.500000         1
3   578.0  16246.000000     5.900000         1
4  1368.0   1000.000000    13.800000         1
5  1145.0   2000.000000    20.000000         2
6  1078.0   2266.699951    16.400000         2
7  1094.0   2966.800049    16.299999         2
8  1237.0   4570.200195    10.500000         2
9   833.0   2830.000000  2000.000000         2

In [38]:
data

   salary         sales        roe  industry
0  1095.0  27595.000000  14.100000         1
1     NaN   9958.000000  10.900000         1
2     NaN   6125.899902  23.500000         1
3   578.0  16246.000000   5.900000         1
4  1368.0           NaN  13.800000         1
5  1145.0           NaN  20.000000         2
6  1078.0   2266.699951  16.400000         2
7  1094.0   2966.800049  16.299999         2
8  1237.0   4570.200195  10.500000         2
9   833.0   2830.000000        NaN         2

* 변수별로 다른 대체방법 사용하기

In [39]:
missing_fill_val = {
    'salary': data.salary.interpolate(),
    'sales': data.sales.mean(),
    'roe': 'missing'
}
print(missing_fill_val)

{'salary': 0    1095.000000
1     922.666667
2     750.333333
3     578.000000
4    1368.000000
5    1145.000000
6    1078.000000
7    1094.000000
8    1237.000000
9     833.000000
Name: salary, dtype: float64, 'sales': 9069.825012125, 'roe': 'missing'}

In [40]:
data_multi = data.fillna(missing_fill_val)
data_multi

        salary         sales        roe  industry
0  1095.000000  27595.000000       14.1         1
1   922.666667   9958.000000       10.9         1
2   750.333333   6125.899902       23.5         1
3   578.000000  16246.000000        5.9         1
4  1368.000000   9069.825012       13.8         1
5  1145.000000   9069.825012       20.0         2
6  1078.000000   2266.699951       16.4         2
7  1094.000000   2966.800049  16.299999         2
8  1237.000000   4570.200195       10.5         2
9   833.000000   2830.000000    missing         2